{"class_name": "Model", "config": {"name": "model_7", "layers": [{"name": "input_7", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 1000, 1], "dtype": "float32", "sparse": false, "name": "input_7"}, "inbound_nodes": []}, {"name": "block1_conv1", "class_name": "Conv1D", "config": {"name": "block1_conv1", "trainable": true, "filters": 16, "kernel_size": [21], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["input_7", 0, 0, {}]]]}, {"name": "activation_75", "class_name": "Activation", "config": {"name": "activation_75", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["block1_conv1", 0, 0, {}]]]}, {"name": "block1_conv2", "class_name": "Conv1D", "config": {"name": "block1_conv2", "trainable": true, "filters": 16, "kernel_size": [21], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["activation_75", 0, 0, {}]]]}, {"name": "activation_76", "class_name": "Activation", "config": {"name": "activation_76", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["block1_conv2", 0, 0, {}]]]}, {"name": "conv1d_105", "class_name": "Conv1D", "config": {"name": "conv1d_105", "trainable": true, "filters": 8, "kernel_size": [1], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["activation_76", 0, 0, {}]]]}, {"name": "conv1d_106", "class_name": "Conv1D", "config": {"name": "conv1d_106", "trainable": true, "filters": 8, "kernel_size": [1], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["activation_76", 0, 0, {}]]]}, {"name": "reshape_105", "class_name": "Reshape", "config": {"name": "reshape_105", "trainable": true, "target_shape": [-1, 8]}, "inbound_nodes": [[["conv1d_105", 0, 0, {}]]]}, {"name": "reshape_106", "class_name": "Reshape", "config": {"name": "reshape_106", "trainable": true, "target_shape": [-1, 8]}, "inbound_nodes": [[["conv1d_106", 0, 0, {}]]]}, {"name": "dot_53", "class_name": "Dot", "config": {"name": "dot_53", "trainable": true, "axes": 2, "normalize": false}, "inbound_nodes": [[["reshape_105", 0, 0, {}], ["reshape_106", 0, 0, {}]]]}, {"name": "conv1d_107", "class_name": "Conv1D", "config": {"name": "conv1d_107", "trainable": true, "filters": 8, "kernel_size": [1], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["activation_76", 0, 0, {}]]]}, {"name": "activation_77", "class_name": "Activation", "config": {"name": "activation_77", "trainable": true, "activation": "softmax"}, "inbound_nodes": [[["dot_53", 0, 0, {}]]]}, {"name": "reshape_107", "class_name": "Reshape", "config": {"name": "reshape_107", "trainable": true, "target_shape": [-1, 8]}, "inbound_nodes": [[["conv1d_107", 0, 0, {}]]]}, {"name": "dot_54", "class_name": "Dot", "config": {"name": "dot_54", "trainable": true, "axes": [2, 1], "normalize": false}, "inbound_nodes": [[["activation_77", 0, 0, {}], ["reshape_107", 0, 0, {}]]]}, {"name": "reshape_108", "class_name": "Reshape", "config": {"name": "reshape_108", "trainable": true, "target_shape": [1000, 8]}, "inbound_nodes": [[["dot_54", 0, 0, {}]]]}, {"name": "conv1d_108", "class_name": "Conv1D", "config": {"name": "conv1d_108", "trainable": true, "filters": 16, "kernel_size": [1], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["reshape_108", 0, 0, {}]]]}, {"name": "add_45", "class_name": "Add", "config": {"name": "add_45", "trainable": true}, "inbound_nodes": [[["activation_76", 0, 0, {}], ["conv1d_108", 0, 0, {}]]]}, {"name": "max_pooling1d_31", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_31", "trainable": true, "strides": [2], "pool_size": [2], "padding": "valid"}, "inbound_nodes": [[["add_45", 0, 0, {}]]]}, {"name": "block2_conv1", "class_name": "Conv1D", "config": {"name": "block2_conv1", "trainable": true, "filters": 32, "kernel_size": [1], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["max_pooling1d_31", 0, 0, {}]]]}, {"name": "activation_78", "class_name": "Activation", "config": {"name": "activation_78", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["block2_conv1", 0, 0, {}]]]}, {"name": "block2_conv2", "class_name": "Conv1D", "config": {"name": "block2_conv2", "trainable": true, "filters": 32, "kernel_size": [21], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["activation_78", 0, 0, {}]]]}, {"name": "activation_79", "class_name": "Activation", "config": {"name": "activation_79", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["block2_conv2", 0, 0, {}]]]}, {"name": "add_46", "class_name": "Add", "config": {"name": "add_46", "trainable": true}, "inbound_nodes": [[["activation_78", 0, 0, {}], ["activation_79", 0, 0, {}]]]}, {"name": "conv1d_109", "class_name": "Conv1D", "config": {"name": "conv1d_109", "trainable": true, "filters": 16, "kernel_size": [1], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["add_46", 0, 0, {}]]]}, {"name": "conv1d_110", "class_name": "Conv1D", "config": {"name": "conv1d_110", "trainable": true, "filters": 16, "kernel_size": [1], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["add_46", 0, 0, {}]]]}, {"name": "reshape_109", "class_name": "Reshape", "config": {"name": "reshape_109", "trainable": true, "target_shape": [-1, 16]}, "inbound_nodes": [[["conv1d_109", 0, 0, {}]]]}, {"name": "reshape_110", "class_name": "Reshape", "config": {"name": "reshape_110", "trainable": true, "target_shape": [-1, 16]}, "inbound_nodes": [[["conv1d_110", 0, 0, {}]]]}, {"name": "dot_55", "class_name": "Dot", "config": {"name": "dot_55", "trainable": true, "axes": 2, "normalize": false}, "inbound_nodes": [[["reshape_109", 0, 0, {}], ["reshape_110", 0, 0, {}]]]}, {"name": "conv1d_111", "class_name": "Conv1D", "config": {"name": "conv1d_111", "trainable": true, "filters": 16, "kernel_size": [1], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["add_46", 0, 0, {}]]]}, {"name": "activation_80", "class_name": "Activation", "config": {"name": "activation_80", "trainable": true, "activation": "softmax"}, "inbound_nodes": [[["dot_55", 0, 0, {}]]]}, {"name": "reshape_111", "class_name": "Reshape", "config": {"name": "reshape_111", "trainable": true, "target_shape": [-1, 16]}, "inbound_nodes": [[["conv1d_111", 0, 0, {}]]]}, {"name": "dot_56", "class_name": "Dot", "config": {"name": "dot_56", "trainable": true, "axes": [2, 1], "normalize": false}, "inbound_nodes": [[["activation_80", 0, 0, {}], ["reshape_111", 0, 0, {}]]]}, {"name": "reshape_112", "class_name": "Reshape", "config": {"name": "reshape_112", "trainable": true, "target_shape": [500, 16]}, "inbound_nodes": [[["dot_56", 0, 0, {}]]]}, {"name": "conv1d_112", "class_name": "Conv1D", "config": {"name": "conv1d_112", "trainable": true, "filters": 32, "kernel_size": [1], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["reshape_112", 0, 0, {}]]]}, {"name": "add_47", "class_name": "Add", "config": {"name": "add_47", "trainable": true}, "inbound_nodes": [[["add_46", 0, 0, {}], ["conv1d_112", 0, 0, {}]]]}, {"name": "max_pooling1d_32", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_32", "trainable": true, "strides": [2], "pool_size": [2], "padding": "valid"}, "inbound_nodes": [[["add_47", 0, 0, {}]]]}, {"name": "block3_conv1", "class_name": "Conv1D", "config": {"name": "block3_conv1", "trainable": true, "filters": 64, "kernel_size": [1], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["max_pooling1d_32", 0, 0, {}]]]}, {"name": "activation_81", "class_name": "Activation", "config": {"name": "activation_81", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["block3_conv1", 0, 0, {}]]]}, {"name": "block3_conv2", "class_name": "Conv1D", "config": {"name": "block3_conv2", "trainable": true, "filters": 64, "kernel_size": [21], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["activation_81", 0, 0, {}]]]}, {"name": "activation_82", "class_name": "Activation", "config": {"name": "activation_82", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["block3_conv2", 0, 0, {}]]]}, {"name": "add_48", "class_name": "Add", "config": {"name": "add_48", "trainable": true}, "inbound_nodes": [[["activation_81", 0, 0, {}], ["activation_82", 0, 0, {}]]]}, {"name": "conv1d_113", "class_name": "Conv1D", "config": {"name": "conv1d_113", "trainable": true, "filters": 32, "kernel_size": [1], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["add_48", 0, 0, {}]]]}, {"name": "conv1d_114", "class_name": "Conv1D", "config": {"name": "conv1d_114", "trainable": true, "filters": 32, "kernel_size": [1], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["add_48", 0, 0, {}]]]}, {"name": "reshape_113", "class_name": "Reshape", "config": {"name": "reshape_113", "trainable": true, "target_shape": [-1, 32]}, "inbound_nodes": [[["conv1d_113", 0, 0, {}]]]}, {"name": "reshape_114", "class_name": "Reshape", "config": {"name": "reshape_114", "trainable": true, "target_shape": [-1, 32]}, "inbound_nodes": [[["conv1d_114", 0, 0, {}]]]}, {"name": "dot_57", "class_name": "Dot", "config": {"name": "dot_57", "trainable": true, "axes": 2, "normalize": false}, "inbound_nodes": [[["reshape_113", 0, 0, {}], ["reshape_114", 0, 0, {}]]]}, {"name": "conv1d_115", "class_name": "Conv1D", "config": {"name": "conv1d_115", "trainable": true, "filters": 32, "kernel_size": [1], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["add_48", 0, 0, {}]]]}, {"name": "activation_83", "class_name": "Activation", "config": {"name": "activation_83", "trainable": true, "activation": "softmax"}, "inbound_nodes": [[["dot_57", 0, 0, {}]]]}, {"name": "reshape_115", "class_name": "Reshape", "config": {"name": "reshape_115", "trainable": true, "target_shape": [-1, 32]}, "inbound_nodes": [[["conv1d_115", 0, 0, {}]]]}, {"name": "dot_58", "class_name": "Dot", "config": {"name": "dot_58", "trainable": true, "axes": [2, 1], "normalize": false}, "inbound_nodes": [[["activation_83", 0, 0, {}], ["reshape_115", 0, 0, {}]]]}, {"name": "reshape_116", "class_name": "Reshape", "config": {"name": "reshape_116", "trainable": true, "target_shape": [250, 32]}, "inbound_nodes": [[["dot_58", 0, 0, {}]]]}, {"name": "conv1d_116", "class_name": "Conv1D", "config": {"name": "conv1d_116", "trainable": true, "filters": 64, "kernel_size": [1], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["reshape_116", 0, 0, {}]]]}, {"name": "add_49", "class_name": "Add", "config": {"name": "add_49", "trainable": true}, "inbound_nodes": [[["add_48", 0, 0, {}], ["conv1d_116", 0, 0, {}]]]}, {"name": "max_pooling1d_33", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_33", "trainable": true, "strides": [2], "pool_size": [2], "padding": "valid"}, "inbound_nodes": [[["add_49", 0, 0, {}]]]}, {"name": "block4_conv1", "class_name": "Conv1D", "config": {"name": "block4_conv1", "trainable": true, "filters": 128, "kernel_size": [1], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["max_pooling1d_33", 0, 0, {}]]]}, {"name": "activation_84", "class_name": "Activation", "config": {"name": "activation_84", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["block4_conv1", 0, 0, {}]]]}, {"name": "block4_conv2", "class_name": "Conv1D", "config": {"name": "block4_conv2", "trainable": true, "filters": 128, "kernel_size": [21], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["activation_84", 0, 0, {}]]]}, {"name": "activation_85", "class_name": "Activation", "config": {"name": "activation_85", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["block4_conv2", 0, 0, {}]]]}, {"name": "add_50", "class_name": "Add", "config": {"name": "add_50", "trainable": true}, "inbound_nodes": [[["activation_84", 0, 0, {}], ["activation_85", 0, 0, {}]]]}, {"name": "conv1d_118", "class_name": "Conv1D", "config": {"name": "conv1d_118", "trainable": true, "filters": 64, "kernel_size": [1], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["add_50", 0, 0, {}]]]}, {"name": "conv1d_117", "class_name": "Conv1D", "config": {"name": "conv1d_117", "trainable": true, "filters": 64, "kernel_size": [1], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["add_50", 0, 0, {}]]]}, {"name": "reshape_118", "class_name": "Reshape", "config": {"name": "reshape_118", "trainable": true, "target_shape": [-1, 64]}, "inbound_nodes": [[["conv1d_118", 0, 0, {}]]]}, {"name": "reshape_117", "class_name": "Reshape", "config": {"name": "reshape_117", "trainable": true, "target_shape": [-1, 64]}, "inbound_nodes": [[["conv1d_117", 0, 0, {}]]]}, {"name": "max_pooling1d_34", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_34", "trainable": true, "strides": [2], "pool_size": [2], "padding": "valid"}, "inbound_nodes": [[["reshape_118", 0, 0, {}]]]}, {"name": "conv1d_119", "class_name": "Conv1D", "config": {"name": "conv1d_119", "trainable": true, "filters": 64, "kernel_size": [1], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["add_50", 0, 0, {}]]]}, {"name": "dot_59", "class_name": "Dot", "config": {"name": "dot_59", "trainable": true, "axes": 2, "normalize": false}, "inbound_nodes": [[["reshape_117", 0, 0, {}], ["max_pooling1d_34", 0, 0, {}]]]}, {"name": "reshape_119", "class_name": "Reshape", "config": {"name": "reshape_119", "trainable": true, "target_shape": [-1, 64]}, "inbound_nodes": [[["conv1d_119", 0, 0, {}]]]}, {"name": "activation_86", "class_name": "Activation", "config": {"name": "activation_86", "trainable": true, "activation": "softmax"}, "inbound_nodes": [[["dot_59", 0, 0, {}]]]}, {"name": "max_pooling1d_35", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_35", "trainable": true, "strides": [2], "pool_size": [2], "padding": "valid"}, "inbound_nodes": [[["reshape_119", 0, 0, {}]]]}, {"name": "dot_60", "class_name": "Dot", "config": {"name": "dot_60", "trainable": true, "axes": [2, 1], "normalize": false}, "inbound_nodes": [[["activation_86", 0, 0, {}], ["max_pooling1d_35", 0, 0, {}]]]}, {"name": "reshape_120", "class_name": "Reshape", "config": {"name": "reshape_120", "trainable": true, "target_shape": [125, 64]}, "inbound_nodes": [[["dot_60", 0, 0, {}]]]}, {"name": "conv1d_120", "class_name": "Conv1D", "config": {"name": "conv1d_120", "trainable": true, "filters": 128, "kernel_size": [1], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["reshape_120", 0, 0, {}]]]}, {"name": "add_51", "class_name": "Add", "config": {"name": "add_51", "trainable": true}, "inbound_nodes": [[["add_50", 0, 0, {}], ["conv1d_120", 0, 0, {}]]]}, {"name": "global_average_pooling1d_7", "class_name": "GlobalAveragePooling1D", "config": {"name": "global_average_pooling1d_7", "trainable": true}, "inbound_nodes": [[["add_51", 0, 0, {}]]]}, {"name": "dense_7", "class_name": "Dense", "config": {"name": "dense_7", "trainable": true, "units": 2, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": {"class_name": "MaxNorm", "config": {"max_value": 3, "axis": 0}}, "bias_constraint": null}, "inbound_nodes": [[["global_average_pooling1d_7", 0, 0, {}]]]}], "input_layers": [["input_7", 0, 0]], "output_layers": [["dense_7", 0, 0]]}, "keras_version": "2.2.2", "backend": "tensorflow"}